#pragma once
#include "ContentsResource.h"


//-----------------------------------------------------
// sendpacket을 호출해주는 함수 (BroadCasting함수에 전달 예정)
//-----------------------------------------------------
void ContentsSendPacket(ULONG64 srcID, ULONG64 destID, char* packet);

//-----------------------------------------------------
// id에 CreatePlayer메세지 만들어서 넣어주는 함수
//-----------------------------------------------------
void ContentsSendCreatePlayerPacket(ULONG64 id);

//-----------------------------------------------------
// 주변 모두에게 함수를 호출해주는 함수 뿌려주는 함수
//-----------------------------------------------------
void MsgSectorBroadCasting(void (*Func)(ULONG64 srcID, ULONG64 destID, char* packet), char* _src, char* Packet, bool SendMe);

//------------------------------------------------------
// MoveStart메세지를 받으면 그 아이디를 클라이언트 좌표로 동기화 후 이동 플래그를 세워줌
//------------------------------------------------------
bool HandleMoveStartMsg(char* payLoad, ULONG64 id);
//------------------------------------------------------
// MoveStop메세지에 있는 좌표로 동기화 후 이동 플래그 꺼줌. MoveStop메세지를 받았다는 확인 메세지 송신
//------------------------------------------------------
bool HandleMoveStopMsg(char* payLoad, ULONG64 id);
//------------------------------------------------------
//섹터 주변에 받은 메세지를 뿌려주는 함수
//------------------------------------------------------
bool HandleLocalChatMsg(char* payLoad, ULONG64 id);
//------------------------------------------------------
//플레이어의 하트비트 시간을 조정해주는 함수
//------------------------------------------------------
bool HandleHeartBeatMsg(ULONG64 id);
//------------------------------------------------------
//모든 채팅 메세지의 송신이 완료 되었다는 의미의 채팅 메세지
//------------------------------------------------------
bool HandleChatEndMsg(ULONG64 id);

//------------------------------------------------------
// Create 메세지를 받아서 실제로 생성해주는 함수
//------------------------------------------------------
bool HandleCreatePlayer(ULONG64 id);
//------------------------------------------------------
// Delete 메세지를 받아서 delete작업을 해주는 함수
//------------------------------------------------------
bool HandleDeletePlayer(ULONG64 id);



//------------------------------------------------------
// dest에게 MoveStop을 완료했다는 메세지를 보내주는 함수
//------------------------------------------------------
void SendMoveStopCompleteMessage(ULONG64 destID);


